run/quickTest/0/air/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{

    airInlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    airOutlet
    {
        type            zeroGradient;
    }

    airSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    cathodeSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }    
    cflSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }        
    air_to_interconnect0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    air_to_electrolyte //cathode
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}


// ************************************************************************* //
