run/quickTest/constant/interconnect0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.001";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1000;

boundaryField
{
    interconnectBottom
    {
        type            zeroGradient;
    }
    interconnectBottomSides
    {
        type            zeroGradient;
    }
    interconnect0_to_air
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
