run/quickTest/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default              none;
    div(rhoCpPhi,T)      Gauss upwind;
}

laplacianSchemes
{
    default              none;
    laplacian(k,T)       Gauss harmonic corrected;
}

interpolationSchemes
{
    default         harmonic;
    interpolate(T)  harmonic;
    interpolate(k)  harmonic;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}


// ************************************************************************* //
